[
    {
      "id": 1,
      "segment_name": "Agricultural",
      "title": "Sunny Fields Farm",
      "image": "https://i.ibb.co/mG12x4P/chris-ensminger-y-JDZTDe-He-G8-unsplash.jpg",
      "description": "This beautiful piece of agricultural land is an exceptional opportunity for anyone looking to engage in farming activities. Spanning a generous area, this land offers rich, fertile soil that is perfect for growing a wide variety of crops. Whether you're interested in cultivating vegetables, fruits, or grains, the nutrient-rich soil will support robust plant growth and yield high-quality produce. The land is also ideal for organic farming, allowing you to grow your crops without the use of synthetic pesticides or fertilizers, thus contributing to a healthier ecosystem and providing consumers with organic options.",
      "price": "500,000",
      "status": "sale",
      "area": "5000",
      "location": "California, USA",
      "facilities": ["Living room", "Swimming pool", "Kitchen"],
      "additional_info": {
        "water_source": "Irrigation system",
        "soil_type": "Loamy"
      }
    },
    {
      "id": 2,
      "segment_name": "Vineyards",
      "title": "Napa Valley Vineyard",
      "image": "https://i.ibb.co/nbMjLZs/tim-mossholder-b-Rw46-I773-E4-unsplash.jpg",
      "description": "This premium vineyard in Napa Valley is renowned for producing top-quality wines. Set amidst breathtaking scenic views, the vineyard benefits from the perfect climate for grape growing, ensuring exceptional grape quality year after year. The fertile soil and ideal weather conditions contribute to the rich flavors and aromas of the wines produced here. Whether you're a wine connoisseur or an aspiring vintner, this vineyard offers an unparalleled opportunity to be part of Napa Valley's prestigious wine-making tradition. The picturesque landscape and premium wine production make this vineyard a prized gem in the heart of California's wine country.",
      "price": "1,200,000",
      "status": "sale",
      "area": "3000",
      "location": "Napa Valley, California, USA",
      "facilities": ["Living room", "Swimming pool", "Kitchen"],
      "additional_info": {
        "grape_varieties": ["Cabernet Sauvignon", "Merlot"],
        "annual_production": "50,000 bottles"
      }
    },
    {
      "id": 3,
      "segment_name": "Plantations",
      "title": "Tropical Palm Plantation",
      "image": "https://i.ibb.co/Y3v3NBm/dan-meyers-0-Agt-Po-AARt-E-unsplash.jpg",
      "description": "This large tropical plantation is ideal for palm oil production, featuring fertile land and ample rainfall throughout the year. The rich, nutrient-dense soil supports robust palm growth, ensuring high yields and quality oil production. Consistent rainfall provides the necessary hydration for the palms, eliminating the need for extensive irrigation systems and reducing operational costs. The plantation's vast expanse allows for significant cultivation, making it a prime investment for large-scale palm oil production. Additionally, the tropical climate fosters a sustainable growing environment, ensuring the longevity and productivity of the plantation. This property is a perfect choice for those looking to capitalize on the lucrative palm oil industry.",
      "price": "800,000",
      "status": "rent",
      "area": "4000",
      "location": "Indonesia",
      "facilities": ["Living room", "Swimming pool", "Kitchen"],
      "additional_info": {
        "crop": "Palm oil",
        "harvest_frequency": "Bi-annual"
      }
    },
    {
      "id": 4,
      "segment_name": "Ranches",
      "title": "Texas Cattle Ranch",
      "image": "https://i.ibb.co/MMt5hhz/stijn-te-strake-Udhpcf-Im-Q9-Y-unsplash.jpg",
      "description": "This expansive cattle ranch boasts modern facilities, making it perfect for livestock rearing and grazing. Spanning a vast area, the ranch provides ample space for cattle to roam and graze freely, ensuring healthy and robust livestock. The state-of-the-art facilities include well-maintained barns, feeding stations, and veterinary care units, designed to optimize cattle health and productivity. The rich pastures offer abundant natural forage, reducing feed costs and promoting sustainable farming practices. With its strategic layout and comprehensive infrastructure, this ranch is an ideal investment for efficient and profitable cattle farming, offering a blend of tradition and modernity in livestock management.",
      "price": "900,000",
      "status": "sale",
      "area": "1000",
      "location": "Texas, USA",
      "facilities": ["Living room", "Swimming pool", "Kitchen"],
      "additional_info": {
        "livestock_capacity": "500 cattle",
        "barns": "3 large barns"
      }
    },
    {
      "id": 5,
      "segment_name": "Desert",
      "title": "Sahara Desert Retreat",
      "image": "https://i.ibb.co/19zn7T0/gilberto-olimpio-VCVNddng5vo-unsplash.jpg",
      "description": "This unique desert land is ideal for tourism or solar energy projects, offering vast open spaces and stunning dunes. The breathtaking landscape, with its rolling sand dunes and expansive horizons, provides an unparalleled setting for eco-tourism, adventure sports, or luxury desert resorts. The consistent sunlight and clear skies make this land perfect for large-scale solar energy installations, promising high efficiency and sustainable energy production. The land’s remote beauty and serene environment offer a tranquil escape for tourists, while its solar potential presents a lucrative opportunity for renewable energy ventures. This desert land combines natural beauty with economic potential, making it a truly remarkable investment.",
      "price": "300,000",
      "status": "rent",
      "area": "2000",
      "location": "Sahara Desert, Morocco",
      "facilities": ["Living room", "Swimming pool", "Kitchen"],
      "additional_info": {
        "potential_uses": ["Tourism", "Solar energy"],
        "climate": "Arid"
      }
    },
    {
      "id": 6,
      "segment_name": "Urban",
      "title": "City Center Plot",
      "image": "https://i.ibb.co/DpfRby3/mark-pisek-j-GBa-N-x-Q5s-U-unsplash.jpg",
      "description": "This prime urban land is located in the heart of the city, making it ideal for commercial or residential development. Its strategic location offers unparalleled access to key amenities, including shopping centers, restaurants, schools, and public transportation, ensuring convenience and high demand. The land's considerable size allows for flexible development options, whether you're envisioning a bustling commercial complex, upscale residential apartments, or a mixed-use development. The vibrant urban setting promises excellent visibility and foot traffic for businesses, while also providing a desirable living environment with easy access to city life. This property represents a unique investment opportunity in a thriving urban landscape.",
      "price": "2,000,000",
      "status": "sale",
      "area": "5000",
      "location": "New York, USA",
      "facilities": ["Living room", "Swimming pool", "Kitchen"],
      "additional_info": {
        "zoning": "Commercial",
        "transport_links": "Excellent"
      }
    },
    {
      "id": 7,
      "segment_name": "Coastal",
      "title": "Beachfront Paradise",
      "image": "https://i.ibb.co/M1JMTYk/colin-watts-s-Bxe6-Ytwcyc-unsplash.jpg",
      "description": "This stunning coastal land offers direct beach access, making it perfect for resort development or a private residence. With breathtaking ocean views and pristine sandy shores, this property provides a picturesque setting for a luxury resort, offering guests an unparalleled beachside experience. The serene environment and soothing sounds of the waves create a tranquil atmosphere, ideal for a private residence where you can enjoy peaceful seaside living. The land's expansive area allows for versatile architectural designs, whether for an exclusive resort with premium amenities or a spacious, elegant home. This coastal land combines natural beauty with limitless development potential.",
      "price": "1,500,000",
      "status": "sale",
      "area": "1000",
      "location": "Malibu, California, USA",
      "facilities": ["Living room", "Swimming pool", "Kitchen"],
      "additional_info": {
        "shoreline_length": "500 meters",
        "water_activities": ["Swimming", "Surfing"]
      }
    },
    {
      "id": 8,
      "segment_name": "Mining",
      "title": "Rich Mineral Land",
      "image": "https://i.ibb.co/8xj6ZTc/artyom-korshunov-NWByxw-VN-J0-unsplash.jpg",
      "description": "This land is rich in mineral resources, making it ideal for mining operations with proven reserves of valuable minerals. With abundant mineral deposits waiting to be unearthed, this property presents a lucrative opportunity for mining companies seeking to extract and profit from these valuable resources. The land's geological surveys have confirmed the presence of valuable minerals, ensuring a reliable source of income for potential investors. Whether it's precious metals, rare earth elements, or industrial minerals, this land offers a wealth of opportunities for mining ventures. With proper exploration and extraction techniques, this property has the potential to yield substantial returns on investment in the mining industry.",
      "price": "3,000,000",
      "status": "rent",
      "area": "1500",
      "location": "Western Australia",
      "facilities": ["Living room", "Swimming pool", "Kitchen"],
      "additional_info": {
        "minerals": ["Gold", "Iron ore"],
        "mining_permits": "Available"
      }
    },
    {
      "id": 9,
      "segment_name": "Wetland",
      "title": "Everglades Wetland Reserve",
      "image": "https://i.ibb.co/d0FXMtF/dave-hoefler-hq-UYUC-ZY8-unsplash.jpg",
      "description": "This protected wetland area boasts rich biodiversity, making it a haven for conservation projects and eco-tourism initiatives. With its diverse ecosystem of wetlands, marshes, and waterways, this land supports a wide array of plant and animal species, including rare and endangered wildlife. Its designation as a protected area ensures the preservation of its natural habitats and the delicate balance of its ecological systems. For conservationists and environmentalists, this land offers an invaluable opportunity to safeguard and restore critical habitats, contributing to the long-term health of our planet. Additionally, its pristine beauty and abundant wildlife make it an attractive destination for eco-conscious travelers seeking immersive nature experiences. Whether it's birdwatching, nature walks, or educational tours, this wetland area promises unforgettable encounters with the wonders of the natural world.",
      "price": "600,000",
      "status": "sale",
      "area": "2000",
      "location": "Florida, USA",
      "facilities": ["Living room", "Swimming pool", "Kitchen"],
      "additional_info": {
        "ecosystem": "Wetland",
        "wildlife": ["Birds", "Reptiles"]
      }
    }
  ]
  